/**
 * @description sta05模板  录音
 * @type 跟读题型
 *
 * 题干：
 * 包含音频、文案、图片
 * 文案字数限制：待定
 * 如果有音频
 * 显示音频播放按钮
 * 音频会自动播放一次
 * 点击音频播放按钮可以切换音频的播放/暂停
 * 每次播放音频都是整个音频重新播放
 * 录音播放按钮：点击可以播放最近一次的录音，如果没有录音成功则置灰不可点击
 *
 * 录音：
 * 单词音频自动播放之后，自动开始录音
 * 录音过程中，再次点击录音按钮结束录音，有文案提示“点击结束录音”
 * 如果录音时间不超过2S，前端显示一个loading状态，等时间达到2S之后再提交录音数据进行评测
 * 录音过程中，“音频播放按钮”和“录音播放”按钮不可点或隐藏
 * 单次录音时长超过15s后自动结束录音，录音中显示15s时间的倒计时（不显示具体数值，通过进度条等方式表现）
 * 答题反馈：
 * 每次录音完成之后，给出语音评测分数
 * 如果分数大于等于60，分数显示为正向
 * 如果分数小于60，分数提示为负向
 * 在第一次作答完成后：
 * 出现【下一步】按钮，可以用重复提交录音并获得打分反馈，不限次数
 */